class Sub < ActiveHash::Base
  self.data = [
    { id: 1, name: '--' },

    { id: 2, name: '排泄介助' }, { id: 3, name: 'トイレでの排泄介助' },
    { id: 4, name: 'Pトイレでの排泄介助' }, { id: 5, name: 'おむつの交換' }, { id: 6, name: 'パッドの交換' },
    { id: 7, name: '陰部洗浄' }, { id: 8, name: '尿器洗浄' }, { id: 9, name: '汚染リネンの交換' },
    { id: 10, name: 'その他の排泄介助' },

    { id: 11, name: '摂食介助' }, { id: 12, name: '水分介助' }, { id: 13, name: 'おやつ介助' },
    { id: 14, name: '配茶・コーヒー' }, { id: 15, name: '見守り' }, { id: 16, name: 'その他の食事介助' },

    { id: 17, name: '移動介助' }, { id: 18, name: '移乗介助' }, { id: 19, name: '体位変換' },
    { id: 20, name: '外出準備' }, { id: 21, name: '帰宅・帰設受け入れ' }, { id: 22, name: 'その他の移動介助' },

    { id: 23, name: '自立浴' }, { id: 24, name: '介助浴' }, { id: 25, name: '機械浴' },
    { id: 26, name: '部分清拭' }, { id: 27, name: '全身清拭' }, { id: 28, name: '見守り浴' }, { id: 29, name: 'その他の入浴介助' },

    { id: 30, name: '洗面' }, { id: 31, name: 'ネイルケア' }, { id: 32, name: '化粧' },
    { id: 33, name: '更衣介助' }, { id: 34, name: 'その他整容介助' },

    { id: 35, name: '道具の用意' }, { id: 36, name: '歯磨きの介助' }, { id: 37, name: '義歯の着脱' },
    { id: 38, name: '義歯の洗浄・管理' }, { id: 39, name: '口腔清拭' }, { id: 40, name: 'その他の口腔介助' },

    { id: 41, name: 'モーニングケア' }, { id: 42, name: 'ナイトケア' }, { id: 43, name: '巡視' },
    { id: 44, name: '就寝・起床の誘導' },

    { id: 45, name: '薬包・薬箱の確認' }, { id: 46, name: '配薬' }, { id: 47, name: '服薬介助' },
    { id: 48, name: '軟膏の塗布' }, { id: 49, name: '湿布の貼付' }, { id: 50, name: 'その他の服薬介助' },

    { id: 51, name: '血圧の測定' }, { id: 52, name: 'バイタルサインの測定' },
    { id: 53, name: '脈拍の測定' }, { id: 54, name: '体温の測定' }, { id: 55, name: '身長・体重の測定' },
    { id: 56, name: '体脂肪率の測定' }, { id: 57, name: 'その他の測定' },

    { id: 58, name: '創傷の処置' }, { id: 59, name: '褥瘡の処置' }, { id: 60, name: '軟膏の塗布' },
    { id: 61, name: 'テープ等の交換' }, { id: 62, name: '湿布の貼付' }, { id: 63, name: 'その他の処置' },

    { id: 64, name: '配薬' }, { id: 65, name: '服薬介助' }, { id: 66, name: '薬剤の確認・管理' },
    { id: 67, name: '薬包・薬箱のセット' }, { id: 68, name: 'その他の服薬看護' },

    { id: 69, name: 'バルーンの交換' }, { id: 70, name: 'バルーンカテーテルの交換' },
    { id: 71, name: '測尿' }, { id: 72, name: '排尿誘導' }, { id: 73, name: 'その他排尿看護' },

    { id: 74, name: 'マッサージ' }, { id: 75, name: '摘便' }, { id: 76, name: '浣腸' },
    { id: 77, name: 'ストマ交換' }, { id: 78, name: 'ストマ洗浄' }, { id: 79, name: 'その他の排便看護' },

    { id: 80, name: '酸素吸入' }, { id: 81, name: 'その他の吸入処置' },

    { id: 82, name: '皮下注射' }, { id: 83, name: '皮内注射' }, { id: 84, name: '筋肉内注射' },
    { id: 85, name: '静脈内注射' }, { id: 86, name: '点滴注射' }, { id: 87, name: 'その他の注射' },

    { id: 88, name: '血糖測定' }, { id: 89, name: '観察' }, { id: 90, name: 'その他の血糖チェック' },

    { id: 91, name: '経鼻栄養補給' }, { id: 92, name: '経腸栄養管理' }, { id: 93, name: 'HPN（静脈栄養法）' },
    { id: 94, name: 'その他の栄養管理' },

    { id: 95, name: 'その他の看護' },

    { id: 96, name: '居室の清掃' }, { id: 97, name: 'トイレの清掃' }, { id: 98, name: '台所の清掃' },
    { id: 99, name: '浴室の清掃' }, { id: 100, name: 'Pトイレの清掃' }, { id: 101, name: '寝室の清掃' },
    { id: 102, name: '廊下の清掃' }, { id: 103, name: '玄関の清掃' }, { id: 104, name: 'ゴミの処理' },
    { id: 105, name: 'その他の清掃' },

    { id: 106, name: '洗濯・乾燥' }, { id: 107, name: '収納' }, { id: 108, name: 'アイロンがけ' },
    { id: 109, name: 'その他の衣類支援' },

    { id: 110, name: 'リネン類の交換' }, { id: 111, name: 'ベッドメイキング' }, { id: 112, name: '布団の洗濯・乾燥' },
    { id: 113, name: 'その他の寝具支援' },

    { id: 114, name: '衣類の整理' }, { id: 115, name: '衣類の補修' }, { id: 116, name: '衣類の収納・衣替え' },
    { id: 117, name: 'その他の衣類支援' },

    { id: 118, name: '調理' }, { id: 119, name: '下ごしらえ' }, { id: 120, name: '調理の見守り' },
    { id: 121, name: 'その他の調理支援' },

    { id: 122, name: '買い物の代行' }, { id: 123, name: '買い物の付き添い' }, { id: 124, name: '注文の代行' },
    { id: 125, name: '薬の受け取り' }, { id: 126, name: 'その他買い物支援' },

    { id: 127, name: 'その他の生活援助' },

    { id: 128, name: '呼吸法の指導' }, { id: 129, name: '排痰法の指導' }, { id: 130, name: 'その他の呼吸リハビリ' },

    { id: 131, name: '嚥下機能訓練' }, { id: 132, name: '嚥下体操' }, { id: 133, name: '口腔ケア' },
    { id: 134, name: 'その他の嚥下リハビリ' },

    { id: 135, name: 'マシントレーニング' }, { id: 136, name: '自重トレーニング' }, { id: 137, name: 'チューブトレーニング' },
    { id: 138, name: '階段昇降' }, { id: 139, name: '歩行運動' }, { id: 140, name: 'その他の筋力維持・増強' },

    { id: 141, name: '関節可動域訓練' }, { id: 142, name: 'ストレッチング' }, { id: 143, name: 'マッサージ' },
    { id: 144, name: 'その他の関節可動域維持・拡大' },

    { id: 145, name: '歩行評価' }, { id: 146, name: '関節可動域評価' }, { id: 147, name: '筋力評価' },
    { id: 148, name: 'ADL評価' }, { id: 149, name: 'その他の機能評価' },

    { id: 150, name: 'その他のリハビリテーション' },

    { id: 151, name: '日常的レクリエーション' }, { id: 152, name: '施設・居宅内レクリエーション' }, { id: 153, name: '外出レクリエーション' },
    { id: 154, name: 'イベント' }, { id: 155, name: 'イベントの準備' }, { id: 156, name: '散策' },
    { id: 157, name: 'その他のレクリエーション' }, { id: 158, name: 'その他' }
  ]
end
